KanatERPSukhova.КанатАдаптация/src/Documents/КАНАТ_РезультатИспытаний/КАНАТ_РезультатИспытаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАНАТ_РезультатИспытаний</name>
  <attributes>
    <name>Цех</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Влажность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НТДПродукции</name>
    <type>
      <types>CatalogRef.КАНАТ_НТДНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаПродукции</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>Структура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаправочныеПараметры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПартияГотовойПродукции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Температура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВлажностьФакт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидГотовойПродукцииИспытания</name>
    <type>
      <types>CatalogRef.КАНАТ_ВидыПродукцииКонтрольКачества</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаИМетодикаИспытаний</name>
    <type>
      <types>CatalogRef.КАНАТ_ПрограммаИМетодикаИспытаний</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСертификатаКачества</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзготовленияГотовойПродукции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерБухты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МассаБухты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаБухты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодСырье</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСырье</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСырье</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СырьеДляПечатнойФормы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сырье</name>
    <attributes>
      <name>Сырье</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаСырья</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НТДСырья</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияСырья</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПримечаниеПоСырью</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатИспытаний</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзм</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДРазмерности</types>
      </type>
    </attributes>
    <attributes>
      <name>Норма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопустимоеОтклонение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыводитьВПФ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/InformationRegisters/РаспределениеЗапасов/РаспределениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="45342faa-1ece-480b-81d1-d8e80e853d58">
  <name>РаспределениеЗапасов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="63380d67-a9d1-4dad-8840-41c7249204ab">
    <name>Запас</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="b1640808-e7c6-4807-936d-bd90cf45049d">
    <name>Свободно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="261e7ab2-2140-4288-a9b8-49b2ba6ae33a">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="071db416-83a1-49bb-8727-0c50e9b7962d">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7ebc9523-5df4-4dfc-ab70-41061e5b8b4f">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c3838a94-5f51-4ad4-832f-097e04916376">
    <name>ЗаказНаОтгрузку</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="908bbc1b-86a0-43c8-b40a-a1c31cf89ac3">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2a3bab03-6376-456d-9d36-7b51914fe435">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="aca20c25-c763-4dc8-909a-2cbf809a16f1">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

KanatERPSukhova.КанатАдаптация/src/Documents/ЗаказНаПроизводство2_2/ЗаказНаПроизводство2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="04b45cc8-19da-4fc2-ab25-fcf16e66f5ee">
  <name>ЗаказНаПроизводство2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="f1e30099-86a8-4d01-b947-c8d4e48da517">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="0190487c-4b35-4793-bebb-cdc5d67bf079">
    <name>Продукция</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КАНАТ_КомментарийКЗаказу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_Сертификат</name>
      <type>
        <types>CatalogRef.КАНАТ_Сертификаты</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="dd131bed-f4cf-4ccb-8427-639b59bd5bf2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fc59acc3-f1f7-4e3f-96da-e580f2c5a88f">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3d295926-ac21-4f62-b76e-64c929f1fc0e">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_НТДНоменклатуры</name>
    <type>
      <types>CatalogRef.КАНАТ_НТДНоменклатуры</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="0e7e0970-627b-458f-8d96-ef13c523d2b8">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КАНАТКач_ВидДляКонтроляКачества</name>
    <type>
      <types>CatalogRef.КАНАТ_ВидыПродукцииКонтрольКачества</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="722c3d13-753d-4b4f-82b9-d41340f96d79">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1b521724-19bd-43e6-b544-b67dc4ba22b9">
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ТекстДублиАртикулов</name>
    <comment>#000000054, ЧТЗ_3_8 Артикул=код</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_НеГенерироватьАртикул</name>
    <comment>#000000054, ЧТЗ_3_8 Артикул=код</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="97ef8ff9-68db-45ee-91be-54bfb600b3a1">
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ОБъектБылИзменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КАНАТ_ПоказателиНТД</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>Размерность</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДРазмерности</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отклонение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/Documents/КАНАТ_РезультатИспытаний/Forms/ФормаДокумента/Module.bsl
//++ Гурьев ЧТЗ_К2_v_6.3

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСертификат();
	ОбновитьСписокВыбораНоменклатурыСырья();
	ОбновитьСписокВыбораЗаказов();
	//++ Гурьев 10.10.23 ЧТЗ_К3
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	//-- Гурьев 10.10.23 ЧТЗ_К3
	ПериодСырье.ДатаНачала = Объект.ДатаНачалаСырье;
	ПериодСырье.ДатаОкончания = Объект.ДатаОкончанияСырье;
	
	//++Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка.
	Если не ЗначениеЗаполнено(Объект.Ссылка) Тогда
	Объект.автор = Пользователи.ТекущийПользователь();	
    конецЕсли;
    Элементы.ГруппаСертификатКачества.Видимость = ложь;
    //ЭтаФорма.Элементы.ГруппаСертификатКачества.Видимость = ложь;
    //--Бит Трейгер П.М. 19.12.2024 Блок Качества. Переделка. 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПродукцияПриИзменении(Элемент)
	ПродукцияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПродукцияПриИзмененииНаСервере()
	
	ЗаполнитьТЧРезультатИспытаний();
	ЗаполнитьСертификат();
	ОбновитьСписокВыбораЗаказов();
	
	Объект.НТДПродукции = Объект.Продукция.КАНАТ_НТДНоменклатуры;
	Объект.ВидГотовойПродукцииИспытания = Объект.Продукция.КАНАТКач_ВидДляКонтроляКачества;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказКлиентаПриИзменении(Элемент)
	ЗаказКлиентаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаказКлиентаПриИзмененииНаСервере()
	ЗаполнитьСертификат();
	ОбновитьСписокВыбораЗаказов();
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	ОбновитьСписокВыбораНоменклатурыСырья();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказНаПроизводствоПриИзменении(Элемент)
	ЗаказНаПроизводствоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаказНаПроизводствоПриИзмененииНаСервере()
	ОбновитьСписокВыбораЗаказов();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказКлиентаОчистка(Элемент, СтандартнаяОбработка)
	ОбновитьСписокВыбораЗаказов();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказНаПроизводствоОчистка(Элемент, СтандартнаяОбработка)
	ОбновитьСписокВыбораЗаказов();
КонецПроцедуры

&НаКлиенте
Процедура ПериодСырьеПриИзменении(Элемент)
	ОбновитьСписокВыбораНоменклатурыСырья();
	Объект.ДатаНачалаСырье = ПериодСырье.ДатаНачала;
	Объект.ДатаОкончанияСырье = ПериодСырье.ДатаОкончания;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРезультатИспытаний

&НаКлиенте
Процедура РезультатИспытанийПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ВыводитьВПФ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСырье

&НаКлиенте
Процедура СырьеПриИзменении(Элемент)
	
	ИзменитьТекстСырьяДляПечати();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьРезультат(Команда)
	ЗаполнитьРезультатСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьСырье(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Период",             ПериодСырье);
	ПараметрыОткрытия.Вставить("Склад",              Объект.Склад);
	ПараметрыОткрытия.Вставить("РезультатИспытаний", Объект.Ссылка);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаПодбораСырьяКлиент", ЭтотОбъект);
	
	ОткрытьФорму("Документ.КАНАТ_РезультатИспытаний.Форма.ФормаПодбораСырья",
				 ПараметрыОткрытия,
				 ЭтаФорма,
				 ,
				 ,
				 ,
				 ОписаниеОповещения,
				 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьСертификат()
	
	Если Объект.Продукция.Пустая() ИЛИ Объект.ЗаказКлиента.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.КАНАТ_Сертификат КАК Сертификат
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &ЗаказКлиента
		|	И ЗаказКлиентаТовары.Номенклатура = &Продукция
		|	И ЗаказКлиентаТовары.КАНАТ_Сертификат <> ЗНАЧЕНИЕ(Справочник.КАНАТ_Сертификаты.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", Объект.ЗаказКлиента);
	Запрос.УстановитьПараметр("Продукция", Объект.Продукция);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Сертификат = ВыборкаДетальныеЗаписи.Сертификат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧРезультатИспытаний()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураКАНАТ_ПоказателиНТД.Показатель КАК Показатель,
		|	НоменклатураКАНАТ_ПоказателиНТД.Размерность КАК ЕдИзм,
		|	НоменклатураКАНАТ_ПоказателиНТД.Значение КАК Норма,
		|	НоменклатураКАНАТ_ПоказателиНТД.Отклонение КАК ДопустимоеОтклонение,
		|	Истина КАК ВыводитьВПФ
		|ИЗ
		|	Справочник.Номенклатура.КАНАТ_ПоказателиНТД КАК НоменклатураКАНАТ_ПоказателиНТД
		|ГДЕ
		|	НоменклатураКАНАТ_ПоказателиНТД.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Продукция);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Объект.РезультатИспытаний.Загрузить(РезультатЗапроса);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРезультатСервер()
	Если Не Объект.НТДПродукции.Пустая() Тогда
		Объект.Результат = СтрШаблон("Соответствует %1", Объект.НТДПродукции.Наименование);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокВыбораНоменклатурыСырья()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаспределениеЗапасов.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|ГДЕ
	|	РаспределениеЗапасов.Склад = &Склад
	|	//И РаспределениеЗапасов.ВНаличии > 0
	|	//И РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
	|	И РаспределениеЗапасов.ЗаказНаОтгрузку.Дата Между &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("Склад",         Объект.Склад);
	Запрос.УстановитьПараметр("ДатаНачала",    ПериодСырье.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ПериодСырье.ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДоступнаяНоменклатура = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		ДоступнаяНоменклатура.Добавить(Выборка.Номенклатура);
		
	КонецЦикла; 
	
	Параметр = Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(ДоступнаяНоменклатура));
	мПараметрыВыбора = Новый Массив;
	мПараметрыВыбора.Добавить(Параметр);
	
	//На данный момент отбор выключен
	//ЭтаФорма.Элементы.Продукция.ПараметрыВыбора = Новый ФиксированныйМассив(мПараметрыВыбора);
	//ЭтаФорма.Элементы.СырьеСсылка.ПараметрыВыбора = Новый ФиксированныйМассив(мПараметрыВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокВыбораЗаказов()
	
	//Запрос
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ЗаказКлиентаТовары.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2 КАК ЗаказНаПроизводство2_2
	               |		ПО ЗаказКлиентаТовары.Ссылка = ЗаказНаПроизводство2_2.ДокументОснование
	               |ГДЕ
	               |	ЗаказКлиентаТовары.Номенклатура = &Номенклатура
	               |	И (&ЗаказНаПроизводствоПараметр = ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	               |			ИЛИ ЗаказНаПроизводство2_2.Ссылка = &ЗаказНаПроизводствоПараметр)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ЗаказНаПроизводство2_2Продукция.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	               |		ПО ЗаказНаПроизводство2_2Продукция.Ссылка.ДокументОснование =  ЗаказКлиента.Ссылка
	               |ГДЕ
	               |	ЗаказНаПроизводство2_2Продукция.Номенклатура = &Номенклатура
	               |	И (&ЗаказКлиентаПараметр = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	               |			ИЛИ ЗаказКлиента.Ссылка = &ЗаказКлиентаПараметр)";
	
	Запрос.УстановитьПараметр("Номенклатура",                Объект.Продукция);
	Запрос.УстановитьПараметр("ЗаказКлиентаПараметр",        Объект.ЗаказКлиента);
	Запрос.УстановитьПараметр("ЗаказНаПроизводствоПараметр", Объект.ЗаказНаПроизводство);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаЗаказКлиента = РезультатЗапроса[0].Выбрать();
	ВыборкаЗаказНаПроизводство = РезультатЗапроса[1].Выбрать();
	
	//Заказ клиента
	ДоступныеЗаказыКлиента = Новый Массив;
	
	Пока ВыборкаЗаказКлиента.Следующий() Цикл
		
		ДоступныеЗаказыКлиента.Добавить(ВыборкаЗаказКлиента.Ссылка);
		
	КонецЦикла; 
	
	Параметр = Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(ДоступныеЗаказыКлиента));
	мПараметрыВыбора = Новый Массив;
	мПараметрыВыбора.Добавить(Параметр);
	
	ЭтаФорма.Элементы.ЗаказКлиента.ПараметрыВыбора = Новый ФиксированныйМассив(мПараметрыВыбора);
	
	//Заказ на производство
	ДоступныеЗаказыНаПроизводство = Новый Массив;
	
	Пока ВыборкаЗаказНаПроизводство.Следующий() Цикл
		
		ДоступныеЗаказыНаПроизводство.Добавить(ВыборкаЗаказНаПроизводство.Ссылка);
		
	КонецЦикла; 
	
	Параметр = Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(ДоступныеЗаказыНаПроизводство));
	мПараметрыВыбора = Новый Массив;
	мПараметрыВыбора.Добавить(Параметр);
	
	ЭтаФорма.Элементы.ЗаказНаПроизводство.ПараметрыВыбора = Новый ФиксированныйМассив(мПараметрыВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодбораСырьяКлиент(МассивСырье, ДопПараметры) Экспорт
	
	Если ТипЗнч(МассивСырье) = Тип("Массив") Тогда
	
		Для Каждого ЭлементСырье Из МассивСырье Цикл
			
			СтрокаСырье = Объект.Сырье.Добавить();
			СтрокаСырье.Сырье = ЭлементСырье.Сырье;
			СтрокаСырье.ХарактеристикаСырья = ЭлементСырье.Характеристика;
			//++Бит Трейгер П.М. 20.12.2024 Блок Качества. Переделка. 
			СтрокаСырье.ПартияСырья = Строка(ЭлементСырье.Серия);
			//--Бит Трейгер П.М. 20.12.2024 Блок Качества. Переделка. 
		КонецЦикла;
		
		ИзменитьТекстСырьяДляПечати();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьТекстСырьяДляПечати()
	
	Объект.СырьеДляПечатнойФормы = "";
	
	Для Каждого Строка Из Объект.Сырье Цикл
		
		Объект.СырьеДляПечатнойФормы = СтрШаблон("%1%2%3%4;",
												 Объект.СырьеДляПечатнойФормы,
												 ?(ЗначениеЗаполнено(Строка.Сырье), " ", "") + Строка.Сырье,
												 ?(ЗначениеЗаполнено(Строка.ХарактеристикаСырья), " ", "") + Строка.ХарактеристикаСырья,
												 ?(ЗначениеЗаполнено(Строка.ПримечаниеПоСырью), " ", "") + Строка.ПримечаниеПоСырью);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СкладНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	//Закоментил, света сказала что не нужно
	//БИТ_++ Шимсиев Накладываем отбор на форму выбора склада
	//СтандартнаяОбработка = ложь;
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("РежимВыбора",Истина); 	
	//ПараметрыОтбора = Новый Структура;
	//ПараметрыОтбора.Вставить("Подразделение", Объект.Цех);
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора); 
	//ОткрытьФорму("Справочник.Склады.ФормаВыбора",ПараметрыФормы,ЭтаФорма);  
	//БИТ_-- Шимсиев Накладываем отбор на форму выбора склада
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) и ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Склады") тогда
		Объект.Склад = ВыбранноеЗначение; 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЦехПриИзменении(Элемент)   
	//БИТ_++ Шимсиев Подставляем склад который принадлежит данному подразделению клиент говорит, что такой будет только 1 (Не верю)
	ИзменитьСклад(Объект.Цех); 
	//БИТ_-- Шимсиев Подставляем склад который принадлежит данному подразделению
КонецПроцедуры

&НаСервере
Процедура ИзменитьСклад(Цех);  
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Склады.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.Подразделение = &Подразделение
		|	И НЕ Склады.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Подразделение", Цех);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.Склад = ВыборкаДетальныеЗаписи.Ссылка; 
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
